schreibfaul1/ESP32-MiniWebRadio/src/common.h
        #define I2C_SDA            41  // I2C, dala line for capacitive touchpad
        #define I2C_SCL            42  // I2C, clock line for capacitive touchpad
#endif
#if TFT_CONTROLLER == 7 // Elecrow
// Pin-Konfiguration

    const TFT_RGB::Pins RGB_PINS = {
        .b0 = 8,
        .b1 = 3,
        .b2 = 46,
        .b3 = 9,
        .b4 = 1,
        .g0 = 5,
        .g1 = 6,
        .g2 = 7,
        .g3 = 15,
        .g4 = 16,
        .g5 = 4,
        .r0 = 45,
        .r1 = 48,
        .r2 = 47,
        .r3 = 21,
        .r4 = 14,
        .hsync = 39,
        .vsync = 41,
        .de = 40,
        .pclk = 0,
        .bl = 2
    };

    const TFT_RGB::Timing RGB_TIMING = {
        .h_res = 800,
        .v_res = 480,
        .pixel_clock_hz = 16000000,
        .hsync_pulse_width = 4,
        .hsync_back_porch =  8,
        .hsync_front_porch = 8,
        .vsync_pulse_width = 4,
        .vsync_back_porch = 8,
        .vsync_front_porch = 8
    };

    #define TP_SDA             19
    #define TP_SCL             20
    #define TP_IRQ             -1

    #define SD_MMC_CMD         11
    #define SD_MMC_CLK         12
    #define SD_MMC_D0          13

    #define I2C_MASTER_FREQ_HZ 400000 // 400 kHz I2C-Frequenz
    #define GT911_I2C_ADDRESS  0x5D   // Standard-I2C-Adresse des GT911

    #define I2S_DOUT           17
    #define I2S_BCLK           42
    #define I2S_LRC            18
    #define I2S_MCLK           -1  // important!

    #define IR_PIN             -1  // IR Receiver (if available)
    #define BT_EMITTER_RX      -1  // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
    #define BT_EMITTER_TX      -1  // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
    #define BT_EMITTER_LINK    -1  // high if connected                     (-1 if not available)
    #define BT_EMITTER_MODE    -1  // high transmit - low receive           (-1 if not available)
    #define BT_EMITTER_CONNECT -1  // -1 if not used

    #define I2C_DAC_SDA        -1  // some DACs are controlled via I2C
    #define I2C_DAC_SCL        -1
    #define SD_DETECT          -1  // some pins on special boards: Lyra, Olimex, A1S ...
    #define HP_DETECT          -1
    #define AMP_ENABLED        -1
    #define TFT_BL             -1

    #define I2C_SDA            -1  // I2C, dala line for capacitive touchpad
    #define I2C_SCL            -1  // I2C, clock line for capacitive touchpad
#endif // Elecrow

#if TFT_CONTROLLER == 8 // Sunton
    const TFT_RGB::Pins RGB_PINS = {
        .b0 = 15,
        .b1 = 7,
        .b2 = 6,
        .b3 = 5,
        .b4 = 4,
        .g0 = 9,
        .g1 = 46,
        .g2 = 3,
        .g3 = 8,
        .g4 = 16,
        .g5 = 1,
        .r0 = 14,
        .r1 = 21,
        .r2 = 47,
        .r3 = 48,
        .r4 = 45,
        .hsync = 39,
        .vsync = 40,
        .de = 41,
        .pclk = 42,
        .bl = 2
    };

    const TFT_RGB::Timing RGB_TIMING = {
        .h_res = 800,
        .v_res = 480,
        .pixel_clock_hz = 16000000,
        .hsync_pulse_width = 18,
        .hsync_back_porch = 80,
        .hsync_front_porch = 30,
        .vsync_pulse_width = 13,
        .vsync_back_porch = 110,
        .vsync_front_porch = 12
    };

    #define TP_SDA 19
    #define TP_SCL 20
    #define TP_IRQ -1

    #define SD_MMC_CMD         11
    #define SD_MMC_CLK         12
    #define SD_MMC_D0          13

    #define I2C_MASTER_FREQ_HZ 400000 // 400 kHz I2C-Frequenz
    #define GT911_I2C_ADDRESS 0x5D   // Standard-I2C-Adresse des GT911

    #define I2S_DOUT            17
    #define I2S_BCLK            0
    #define I2S_LRC             18
    #define I2S_MCLK           -1  // important!

    #define IR_PIN             -1  // IR Receiver (if available)
    #define BT_EMITTER_RX      -1  // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
    #define BT_EMITTER_TX      -1  // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
    #define BT_EMITTER_LINK    -1  // high if connected                     (-1 if not available)
    #define BT_EMITTER_MODE    -1  // high transmit - low receive           (-1 if not available)
    #define BT_EMITTER_CONNECT -1  // -1 if not used

    #define I2C_DAC_SDA        -1  // some DACs are controlled via I2C
    #define I2C_DAC_SCL        -1
    #define SD_DETECT          -1  // some pins on special boards: Lyra, Olimex, A1S ...
    #define HP_DETECT          -1
    #define AMP_ENABLED        -1
    #define TFT_BL             -1

    #define I2C_SDA            -1  // I2C, dala line for capacitive touchpad
    #define I2C_SCL            -1  // I2C, clock line for capacitive touchpad
#endif // Sunton

#if TFT_CONTROLLER == 9 // Waveshare
// Pin-Konfiguration

    const TFT_RGB::Pins RGB_PINS = {
        .b0 = 14,
        .b1 = 38,
        .b2 = 18,
        .b3 = 17,
        .b4 = 10,
        .g0 = 39,
        .g1 = 0,
        .g2 = 45,
        .g3 = 48,
        .g4 = 47,
        .g5 = 21,
        .r0 = 1,
        .r1 = 2,
        .r2 = 42,
        .r3 = 41,
        .r4 = 40,
        .hsync = 46,
        .vsync = 3,
        .de = 5,
        .pclk = 7,
        .bl = -1
    };

    const TFT_RGB::Timing RGB_TIMING = {
        .h_res = 800,
        .v_res = 480,
        .pixel_clock_hz = 15000000,
        .hsync_pulse_width = 4,
        .hsync_back_porch = 4,
        .hsync_front_porch = 8,
        .vsync_pulse_width = 4,
        .vsync_back_porch = 2,
        .vsync_front_porch = 18
    };

    #define TP_SDA 8
    #define TP_SCL 9
    #define TP_IRQ -1

    #define SD_MMC_CMD         11
    #define SD_MMC_CLK         12
    #define SD_MMC_D0          13

    #define I2C_MASTER_FREQ_HZ 400000 // 400 kHz I2C-Frequenz
    #define GT911_I2C_ADDRESS 0x14 // I2C-Adresse des GT911

    #define I2S_DOUT            6
    #define I2S_BCLK           15
    #define I2S_LRC            16
    #define I2S_MCLK           -1  // important!

    #define IR_PIN             -1  // IR Receiver (if available)
    #define BT_EMITTER_RX      -1  // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
    #define BT_EMITTER_TX      -1  // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
    #define BT_EMITTER_LINK    -1  // high if connected                     (-1 if not available)
    #define BT_EMITTER_MODE    -1  // high transmit - low receive           (-1 if not available)
    #define BT_EMITTER_CONNECT -1  // -1 if not used

    #define I2C_DAC_SDA        -1  // some DACs are controlled via I2C
    #define I2C_DAC_SCL        -1
    #define SD_DETECT          -1  // some pins on special boards: Lyra, Olimex, A1S ...
    #define HP_DETECT          -1
    #define AMP_ENABLED        -1
    #define TFT_BL             -1

    #define I2C_SDA            -1  // I2C, dala line for capacitive touchpad
    #define I2C_SCL            -1  // I2C, clock line for capacitive touchpad


#endif // Waveshare
#endif

//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// output on serial terminal
#define ANSI_ESC_RESET          "\033[0m"
#define ANSI_ESC_BLACK          "\033[30m"
#define ANSI_ESC_RED            "\033[31m"
#define ANSI_ESC_GREEN          "\033[32m"
#define ANSI_ESC_YELLOW         "\033[33m"
#define ANSI_ESC_BLUE           "\033[34m"
#define ANSI_ESC_MAGENTA        "\033[35m"
#define ANSI_ESC_CYAN           "\033[36m"
#define ANSI_ESC_WHITE          "\033[37m"

#define ANSI_ESC_GREY           "\033[90m"
#define ANSI_ESC_LIGHTRED       "\033[91m"
#define ANSI_ESC_LIGHTGREEN     "\033[92m"
#define ANSI_ESC_LIGHTYELLOW    "\033[93m"
#define ANSI_ESC_LIGHTBLUE      "\033[94m"
#define ANSI_ESC_LIGHTMAGENTA   "\033[95m"
#define ANSI_ESC_LIGHTCYAN      "\033[96m"
#define ANSI_ESC_LIGHTGREY      "\033[97m"

#define ANSI_ESC_DARKRED        "\033[38;5;52m"
#define ANSI_ESC_DARKGREEN      "\033[38;5;22m"
#define ANSI_ESC_DARKYELLOW     "\033[38;5;136m"
#define ANSI_ESC_DARKBLUE       "\033[38;5;17m"
#define ANSI_ESC_DARKMAGENTA    "\033[38;5;53m"
#define ANSI_ESC_DARKCYAN       "\033[38;5;23m"
#define ANSI_ESC_DARKGREY       "\033[38;5;240m"

#define ANSI_ESC_BROWN          "\033[38;5;130m"
#define ANSI_ESC_ORANGE         "\033[38;5;214m"
#define ANSI_ESC_DARKORANGE     "\033[38;5;166m"
#define ANSI_ESC_LIGHTORANGE    "\033[38;5;215m"
#define ANSI_ESC_PURPLE         "\033[38;5;129m"
#define ANSI_ESC_PINK           "\033[38;5;213m"
#define ANSI_ESC_LIME           "\033[38;5;190m"
#define ANSI_ESC_NAVY           "\033[38;5;25m"
#define ANSI_ESC_AQUAMARINE     "\033[38;5;51m"
#define ANSI_ESC_LAVENDER       "\033[38;5;189m"

#define ANSI_ESC_LIGHTBROWN     "\033[38;2;210;180;140m"

