schreibfaul1/ESP32-MiniWebRadio/src/common.h
            getFileFolderByIndex(0) returns "/dir_a/"
            getFileFolderByIndex(1) returns "/dir_a/dir_b/"
            getFileFolderByIndex(5) returns "/dir_a/"
        */
        if(isDir(idx)) return m_files[idx].filePath;
        int lastSlashIndex = lastIndexOf(m_files[idx].filePath, '/');
        strcpy(m_buff, m_files[idx].filePath);
        m_buff[lastSlashIndex + 1] = '\0';
        return m_buff;
    }

    int16_t getIndexByName(const char* path){
    /*
        dir_a
            dir_b
                file_a
                file_b
            file_c
            file_d

        getIndexByName("/dir_a") returns 0
        getIndexByName("/dir_a/dir_b/file_b") returns 3
        getIndexByName("/dir_a/dir_b/file_y") returns -1
    */
        if(!path) return -1;
        for(int i = 0; i <  m_files.size(); i++){
            if(strcmp((const char*)m_files[i].filePath, path) == 0){
                return i;
            }
        }
        return -1;
    }

    uint16_t getNextAudioFile(uint16_t currIdx){ // assume listFilesInDir with "audioFilesOnly"
        if(m_files.size() == 0) return 0;
        if(currIdx >= m_files.size()) currIdx = m_files.size() -1;
        int16_t newIdx = currIdx;
        while(true){
            newIdx++;
            if(newIdx >= m_files.size()) newIdx = 0;
            if(newIdx == currIdx) break; // avoid an infinite loop
            if(!endsWith(m_files[newIdx].fileName, ".m3u")) break; // skip m3u files
        }
        return newIdx;
    }

    uint16_t getPrevAudioFile(uint16_t currIdx){ // assume listFilesInDir with "audioFilesOnly"
        if(m_files.size() == 0) return 0;
        if(currIdx >= m_files.size()) currIdx = m_files.size() -1;
        int16_t newIdx = currIdx;
        while(true){
            newIdx--;
            if(newIdx == -1) newIdx = m_files.size() - 1;
            if(newIdx == currIdx) break; // avoid an infinite loop
            if(!endsWith(m_files[newIdx].fileName, ".m3u")) break; // skip m3u files
        }
        return newIdx;
    }

    void setLastConnectedFile(const char* lastconnectedItem){
/*  lastconnectedItem                       m_lastConnectedFolder       m_lastConnectedFileName     m_lastConnectedFile
    "/audiofiles/wavfiles/chicken.wav"      "/audiofiles/wavfiles/"     "chicken.wav"               "/audiofiles/wavfiles/chicken.wav"
    "xyz/chicken.wav"                       "/audiofiles/"              ""                          "/audiofiles/"                      // does not start with "/"
    "/audiofiles/wavfiles/chickenwav"       "/audiofiles/wavfiles/"     ""                          "/audiofiles/wavfiles/"             // file has no extension
    "/chicken.wav"                          "/"                         "chicken.wav"               "/chicken.wav"                      // we have no folder
    "/audiofiles/wavfiles/"                 "/audiofiles/wavfiles/"     ""                          "/audiofiles/wavfiles/"             // we have no file
    "/audiofiles/wavfiles/.wav"             "/audiofiles/wavfiles/"     ""                          "/audiofiles/wavfiles/"             // file has no name
*/
        x_ps_free(&m_lastConnectedFileName);
        x_ps_free(&m_lastConnectedFolder);
        int posFirst = 0, posLast = 0, posDot = 0;
        if(!lastconnectedItem) { // guard, lastconnectedItem == NULL
            m_lastConnectedFileName = x_ps_strdup("");
            m_lastConnectedFolder = x_ps_strdup("/audiofiles/");
            goto exit;
        }
        posFirst = indexOf(lastconnectedItem, "/", 0);
        posLast = lastIndexOf(lastconnectedItem, '/');
        if(posFirst != 0) { // guard, does not start with /
            m_lastConnectedFileName = x_ps_strdup("");
            m_lastConnectedFolder = x_ps_strdup("/audiofiles/");
            goto exit;
        }
        if(posLast == 0){m_lastConnectedFolder = x_ps_strdup("/");} // we have no folder name
        else {m_lastConnectedFolder = x_ps_strndup(lastconnectedItem, posLast + 1);}

        if(posLast == strlen(lastconnectedItem) - 1){m_lastConnectedFileName = x_ps_strdup("");} // we have no file name
        else{m_lastConnectedFileName = x_ps_strdup(lastconnectedItem + posLast + 1);}

        //log_e("posFirst %i, posLast %i, m_lastConnectedFileName %s, m_lastConnectedFolder %s", posFirst, posLast, m_lastConnectedFileName, m_lastConnectedFolder);
        posDot = indexOf(m_lastConnectedFileName, ".", 0);
        if(posDot == -1){ // no extension
            x_ps_free(&m_lastConnectedFileName);
            m_lastConnectedFileName = x_ps_strdup("");
        }

    exit:
        x_ps_free(&m_lastConnectedFile);
        m_lastConnectedFile = x_ps_malloc(strlen(m_lastConnectedFolder) + strlen(m_lastConnectedFileName) + 1);
        strcpy(m_lastConnectedFile, m_lastConnectedFolder);
        strcat(m_lastConnectedFile, m_lastConnectedFileName);
        // log_e("lastconnectedItem %s", lastconnectedItem);
        // log_e("lastConnectedFile %s", m_lastConnectedFile);
        // log_e("m_lastConnectedFileName %s", m_lastConnectedFileName);
        // log_e("m_lastConnectedFolder %s", m_lastConnectedFolder);
        listFilesInDir(m_lastConnectedFolder, true, false);
        sort();
    }
    const char* getLastConnectedFolder(){
        return m_lastConnectedFolder;
    }

    const char* getLastConnectedFileName(){
        return m_lastConnectedFileName;
    }
    int getPosByFileName(const char* fileName){
        for(int i = 0; i < m_files.size(); i++){
            if(!strcmp(m_files[i].fileName, fileName)) return i; // fileName e.g. "file.mp3"
        }
        return 0;
    }

private:
    void freeFilesVector() {
        m_files.clear();
    }

    void sort(){
        std::sort(m_files.begin(), m_files.end(), [](const FileInfo& a, const FileInfo& b) {
            // Zuerst nach Ordner vs. Datei sortieren
            if (a.fileSize == -1 && b.fileSize != -1) {
                return true;  // a ist Ordner, b ist Datei
            }
            if (a.fileSize != -1 && b.fileSize == -1) {
                return false;  // a ist Datei, b ist Ordner
            }
            // Wenn beide entweder Ordner oder beide Dateien sind, alphabetisch sortieren
            return strcmp(a.fileName, b.fileName) < 0;
        });
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class stationManagement{
private:
    struct sta{
        std::vector<uint8_t> fav;
        std::vector<uint16_t>favStaNr;
        std::vector<char*> country;
        std::vector<char*> name;
        std::vector<char*> url;
    } m_stations;

