schreibfaul1/ESP32-MiniWebRadio/src/common.h
    void setOffPicturePath(const char* path){
        x_ps_free(&m_offPicturePath);
        if(path) m_offPicturePath = x_ps_strdup(path);
        else m_offPicturePath = x_ps_strdup("defaultPicturePath is not set");
    }
    void setClickedOffPicturePath(const char* path){
        x_ps_free(&m_clickedOffPicturePath);
        if(path) m_clickedOffPicturePath = x_ps_strdup(path);
        else m_clickedOffPicturePath = x_ps_strdup("clickedOffPicturePath is not set");
    }
    void setClickedOnPicturePath(const char* path){
        x_ps_free(&m_clickedOnPicturePath);
        if(path) m_clickedOnPicturePath = x_ps_strdup(path);
        else m_clickedOnPicturePath = x_ps_strdup("clickedOnPicturePath is not set");
    }
    void setOnPicturePath(const char* path){
        x_ps_free(&m_onPicturePath);
        if(path) m_onPicturePath = x_ps_strdup(path);
        else m_onPicturePath = x_ps_strdup("clickedPicturePath is not set");
    }
    void setInactivePicturePath(const char* path){
        x_ps_free(&m_inactivePicturePath);
        if(path) m_inactivePicturePath = x_ps_strdup(path);
        else m_inactivePicturePath = x_ps_strdup("inactivePicturePath is not set");
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled){
            if(m_state) drawImage(m_clickedOnPicturePath, m_x, m_y, m_w, m_h);
            else        drawImage(m_clickedOffPicturePath, m_x, m_y, m_w, m_h);
            m_clicked = true;
            m_state = !m_state;
        }
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        if(m_state) drawImage(m_onPicturePath, m_x, m_y, m_w, m_h);
        else drawImage(m_offPicturePath, m_x, m_y, m_w, m_h);
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class numbersBox : public RegisterTable { // range 000...999
private:
    bool        m_enabled = false;
    uint8_t     m_segmWidth = 0;
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    bool        m_clicked = false;
    releasedArg m_ra;
    char*       m_name = NULL;
    char        m_root[20] = "/digits_small/";
    char        m_numbers[4] = "000";
public:
    numbersBox(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("numbersBox");

        if(TFT_CONTROLLER < 2) {m_segmWidth = 48;}
        else                   {m_segmWidth = 64;}
    }
    ~numbersBox(){
        x_ps_free(&m_name);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
    }
    const char* getName(){
        return m_name;
    }
    bool show(){
        if(!m_enabled) return false;
        char path[50];
        for(uint8_t i = 0; i < 3; i++){
            sprintf(path,"%s%csbl.jpg", m_root, m_numbers[i]);
            if(!drawImage(path, m_x + i * m_segmWidth, m_y)) return false;;
        }
        return true;
    }
    void hide(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        m_enabled = false;
    }
    void disable(){
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void setNumbers(uint16_t numbers){
        if(numbers > 999) return;
        snprintf(m_numbers, sizeof(m_numbers), "%03u", numbers);
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class pictureBox : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    char*       m_PicturePath = NULL;
    char*       m_altPicturePath = NULL;
    char*       m_name = NULL;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_backgroundTransparency = false;
    bool        m_saveBackground = false; // is used and to draw further objects on this box
    releasedArg m_ra;
public:
    pictureBox(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("pictureBox");
        setPicturePath(NULL);
        setAlternativPicturePath(NULL);
    }
    ~pictureBox(){
        x_ps_free(&m_name);
        x_ps_free(&m_PicturePath);
        x_ps_free(&m_altPicturePath);
    }
    void begin(uint16_t x, uint16_t y, bool backgroundTransparency = false){
        m_x = x; // x pos
        m_y = y; // y pos
        m_enabled = false;
        m_backgroundTransparency = backgroundTransparency;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    bool show(bool saveBackground = false){
        m_saveBackground = saveBackground;
        if(!GetImageSize(m_PicturePath)){
            GetImageSize(m_altPicturePath);
            if(m_saveBackground){
                tft.copyFramebuffer(1, 2, m_x, m_y, m_w, m_h);
            }
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
            }
            m_enabled = drawImage(m_altPicturePath, m_x, m_y);
            if(m_saveBackground){
                tft.copyFramebuffer(0, 1, m_x, m_y, m_w, m_h);
            }
            return m_enabled;
        }
        else{
            if(m_saveBackground){
                tft.copyFramebuffer(1, 2, m_x, m_y, m_w, m_h);
            }
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
            }
            m_enabled = drawImage(m_PicturePath, m_x, m_y);
            if(m_saveBackground){
                tft.copyFramebuffer(0, 1, m_x, m_y, m_w, m_h);
            }
            return m_enabled;
        }
    }
    void hide(){
        if(m_saveBackground){
            tft.copyFramebuffer(2, 1, m_x, m_y, m_w, m_h); // restore background
        }
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        m_enabled = false;
    }
    void disable(){
        if(m_saveBackground){
            tft.copyFramebuffer(2, 1, m_x, m_y, m_w, m_h); // restore background
        }
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    void setPicturePath(const char* path){
        if(m_PicturePath){x_ps_free(&m_PicturePath); m_PicturePath = NULL;}
        if(path) m_PicturePath = x_ps_strdup(path);
        else m_PicturePath = x_ps_strdup("picturePath is not set");
        if(path){GetImageSize(path);}
    }
    void setAlternativPicturePath(const char* path){
        x_ps_free(&m_altPicturePath);
        if(path) m_altPicturePath = x_ps_strdup(path);
        else m_altPicturePath = x_ps_strdup("alternativePicturePath is not set");
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
private:
    bool GetImageSize(const char* picturePath){
        const char* scaledPicPath = scaleImage(picturePath);
        if(!SD_MMC.exists(scaledPicPath)) {/*log_w("file %s not exists, objName: %s", scaledPicPath, m_name);*/ return false;}
        File file = SD_MMC.open(scaledPicPath,"r", false);
        if(file.size() < 24) {log_w("file %s is too small", scaledPicPath); file.close(); return false;}
        char buf[8];
        file.readBytes(buf,3);
        if ((buf[0] == 0xFF) && (buf[1] == 0xD8) && (buf[2] == 0xFF)) { // format jpeg
            int16_t c1, c2;
            while(true){
                c1 = file.read();
                if(c1 == -1) {log_w("sof marker in %s not found", scaledPicPath); file.close(); return false;} //end of file reached
                if(c1 == 0xFF){c2 = file.read(); if(c2 == 0xC0) break;} // 0xFFC0 Marker found
            }
            file.readBytes(buf,7);
            m_h = buf[3] * 256 + buf[4];
            m_w = buf[5] * 256 + buf[6];
        //    log_i("w %i, h %i", m_w, m_h);
            return true;
        }
        if ((buf[0] == 'B') && (buf[1] == 'M') && (buf[2] == '6')) { // format bmp
            for(int i= 0; i < 15; i++) file.read(); // read 15 dummys
            m_w  = file.read(); // pos 18
            m_w += (file.read() << 8);
            m_w += (file.read() << 16);
            m_w += (file.read() << 24);
            m_h  = file.read(); // pos 22
            m_h += (file.read() << 8);
            m_h += (file.read() << 16);
            m_h += (file.read() << 24);
        //    log_i("w %i, h %i", m_w, m_h);
            return true;
        }
        if ((buf[0] == 'G') && (buf[1] == 'I') && (buf[2] == 'F')) { // format gif
            for(int i= 0; i < 3; i++) file.read(); // read 3 dummys
            m_w  = file.read(); // pos 6
            m_w += (file.read() << 8);
            m_h  = file.read(); // pos 8
            m_h += (file.read() << 8);
        //    log_i("w %i, h %i", m_w, m_h);
            return true;
        }
        if ((buf[0] == 0x89) && (buf[1] == 'P') && (buf[2] == 'N')) { // format png
            for(int i= 0; i < 13; i++) file.read(); // read 13 dummys
            m_w =  file.read() << 24; // pos 16
            m_w += file.read() << 16; // pos 17
            m_w += file.read() << 8;  // pos 18
            m_w += file.read() ;      // pos 19
            m_h =  file.read() << 24; // pos 20
            m_h += file.read() << 16; // pos 21
            m_h += file.read() << 8;  // pos 22
            m_h += file.read() ;      // pos 23

