schreibfaul1/ESP32-MiniWebRadio/src/common.h
            }
            m_oldAlarmDigits[i] = m_alarmDigits[i];
        }
    }
    void updateAlarmDaysAndTime(){
        tft.setFont(m_fontSize);
        uint8_t mask = 0b00000001;
        uint16_t color = TFT_BLACK;
        for(int i = 0; i < 7; i++){
            // alarmDays
            if(*m_alarmDays & mask) color = TFT_RED;
            else color = TFT_DARKGREY;
            tft.drawRect(m_alarmdaysXPos[i], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, color);
            tft.setTextColor(color);
            tft.writeText(m_WD[i], m_alarmdaysXPos[i], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, true);
            // alarmTime
            if(*m_alarmDays & mask){
            //    tft.fillRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_BLACK);
                tft.drawRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_GREEN);
                tft.setTextColor(TFT_GREEN);
                char hhmm[10] = "00:00";
                sprintf(hhmm, "%02d:%02d", m_alarmTime[i] / 60, m_alarmTime[i] % 60);
                tft.writeText(hhmm, m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, true);
            }
            else{
                tft.fillRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_BLACK);
                tft.drawRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_DARKGREY);
            }
            mask <<= 1;
        }
    }
    void alarmDaysPressed(uint8_t idx){
        tft.setFont(m_fontSize);
        tft.drawRect(m_alarmdaysXPos[idx], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, TFT_YELLOW);
        tft.setTextColor(TFT_YELLOW);
        tft.writeText(m_WD[idx], m_alarmdaysXPos[idx], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, true);
    }
    void alarmTimePressed(uint8_t idx){
        uint8_t mask = 0b00000001;
        mask <<= idx;
        if(mask & *m_alarmDays){ // bit is set -> active
            tft.setFont(m_fontSize);
            tft.fillRect(m_alarmdaysXPos[idx], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_BLACK);
            tft.drawRect(m_alarmdaysXPos[idx], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_YELLOW);
            tft.setTextColor(TFT_YELLOW);
            m_alarmTime[idx] = (m_alarmDigits[0] * 10 + m_alarmDigits[1]) * 60  + (m_alarmDigits[2] * 10 + m_alarmDigits[3]);
            char hhmm[10] = "00:00";
            sprintf(hhmm, "%02d:%02d", m_alarmTime[idx] / 60, m_alarmTime[idx] % 60);
            tft.writeText(hhmm, m_alarmdaysXPos[idx], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER, true);
        }
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class uniList {

private:
    int16_t                   m_x = 0;
    int16_t                   m_y = 0;
    int16_t                   m_w = 0;
    int16_t                   m_h = 0;
    int32_t                   m_nr[10] = {0};
    uint8_t                   m_fontSize = 0;
    uint8_t                   m_lineHight = 0;
    uint8_t                   m_mode = 0;
    uint32_t                  m_bgColor = 0;
    char*                     m_name = NULL;
    char*                     m_buff = NULL;
    char*                     m_txt[10] = {0};
    char*                     m_ext1[10] = {0};
    char*                     m_ext2[10] = {0};
    bool                      m_enabled = false;

public:
    uniList(const char* name){
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("dlnaList");
        m_bgColor = TFT_BLACK;
    }
    ~uniList(){
        x_ps_free(&m_name);
        x_ps_free(&m_buff);
        for(int i = 0; i < 10; i++){x_ps_free(&m_txt[i]); x_ps_free(&m_ext1[i]); x_ps_free(&m_ext2[i]);}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_fontSize = fontSize;
        m_enabled = false;
        m_lineHight = m_h / 10;
        m_buff = x_ps_malloc(1024);
    }
    void setMode(uint8_t mode){
        if(mode == RADIO)  {m_mode = RADIO;}
        if(mode == PLAYER) {m_mode  = PLAYER;}
        if(mode == DLNA)   {m_mode = DLNA;}
    }
    void clearList(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        for(int i = 0; i < 10; i++){
           x_ps_free(&m_txt[i]);
           x_ps_free(&m_ext1[i]);
           x_ps_free(&m_ext2[i]);
            m_nr[i] = -1;
        }
    }
    void drawLine(uint8_t pos, const char* txt, const char* ext1 = NULL, const char* ext2 = NULL, const char* color = ANSI_ESC_WHITE, int32_t nr = -1){
        if(pos > 9) return;
        if(!txt) return;
        tft.setFont(m_fontSize);
        if(m_mode == RADIO){
            sprintf(m_buff, ANSI_ESC_YELLOW "%03li %s%s" , nr, color, txt);
            if(txt ){x_ps_free(&m_txt[pos]);  m_txt[pos]  = strdup(txt);}
            if(ext1){x_ps_free(&m_ext1[pos]); m_ext1[pos] = strdup(ext1);}
            if(ext2){x_ps_free(&m_ext2[pos]); m_ext2[pos] = strdup(ext2);}
            m_nr[pos] = nr;
        }
        if(m_mode == DLNA){
            if(!txt) {log_e("txt is NULL"); return;}
            if(!ext1)                sprintf(m_buff, "%s%s", color, txt);
            else if(ext1[0] == '\0') sprintf(m_buff, "%s%s", color, txt);
            else                     sprintf(m_buff, "%s%s " ANSI_ESC_CYAN "(%s)" , color, txt, ext1);
            if(txt) {x_ps_free(&m_txt[pos]);  m_txt[pos] = strdup(txt);  m_nr[pos] = 1;}
            if(ext1){x_ps_free(&m_ext1[pos]); m_ext1[pos] = strdup(ext1);}
            if(ext2){x_ps_free(&m_ext2[pos]); m_ext2[pos] = strdup(ext2);}
        }
        if(m_mode == PLAYER){
            if(!txt) {log_e("txt is NULL"); return;}
            if(!nr)  sprintf(m_buff, "%s%s", color, txt);
            else     sprintf(m_buff, "%s%s" ANSI_ESC_YELLOW " %li" , color, txt, nr);
            if(txt) {x_ps_free(&m_txt[pos]);  m_txt[pos] = strdup(txt);  m_nr[pos] = nr;}
        }
        tft.writeText(m_buff, pos? 20 : 10, m_y + pos *m_lineHight, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
    }
    void drawPosInfo(int16_t firstVal, int16_t secondVal, int16_t total, const char* color){ // e.g. 1-9/65
        sprintf(m_buff, "%s%i-%i/%i", color, firstVal, secondVal, total);
        tft.writeText(m_buff, 0, m_y, m_w, m_lineHight, TFT_ALIGN_RIGHT, TFT_ALIGN_CENTER, true, true);
    }
    void colourLine(uint8_t pos, const char* color = ANSI_ESC_WHITE) {
        if(pos > 9) return;
        tft.setFont(m_fontSize);
        if(m_mode == RADIO){
            sprintf(m_buff, ANSI_ESC_YELLOW "%03li %s%s" , m_nr[pos], color, m_txt[pos]);
        }
        if(m_mode == PLAYER){
            if(m_nr[pos]) sprintf(m_buff, "%s%s" ANSI_ESC_YELLOW " %li", color, m_txt[pos], m_nr[pos]); // file
            else          sprintf(m_buff, "%s%s", color, m_txt[pos]);                                   // directory
        }
        tft.writeText(m_buff, pos? 20 : 10, m_y + pos *m_lineHight, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
    }
    const char* getTxtByPos(uint8_t pos){
        return m_txt[pos];
    }
    int16_t getNumberByPos(uint8_t pos){
        return m_nr[pos];
    }
    void drawTriangeUp(){
        auto triangleUp = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + s, y + 0, x + 0, y + 2 * s, x + 2 * s, y + 2 * s, TFT_RED); };
         triangleUp(0, m_y + (1 * m_lineHight), m_lineHight / 3.5);
    }
    void drawTriangeDown(){
        auto triangleDown = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + 0, y + 0, x + 2 * s, y + 0, x + s, y + 2 * s, TFT_RED); };
        triangleDown(0, m_y + (9 * m_lineHight), m_lineHight / 3.5);
    }

