schreibfaul1/ESP32-MiniWebRadio/src/common.h
};
extern uniList myList;
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
/*
  ———————————————————————————————————————————————————————
  | DLNA List                       Vol3    01:10:32    |           m_itemsListPos
  | Musik                                      1-9/6    |           <-- 0
  |   Videos(7)                                         |           <-- 1
  |   Interpreten(2)                                    |           <-- 2
  |   Alben                                             |           <-- 3
  |   Alle Titel(7)                                     |           <-- 4
  |   Genres                                            |           <-- 5
  |   Ordner(1)                                         |           <-- 6
  |   Wiedergabelisten                                  |           <-- 7
  |   Filme(23)                                         |           <-- 8
  |                                                     |           <-- 9
  | 003   0:00    128K              IP:192.168.178.24   |
  ———————————————————————————————————————————————————————
*/

class dlnaList : public RegisterTable {
private:
    int16_t                   m_x = 0;
    int16_t                   m_y = 0;
    int16_t                   m_w = 0;
    int16_t                   m_h = 0;
    int16_t                   m_oldX = 0;
    int16_t                   m_oldY = 0;
    uint8_t*                  m_dlnaLevel;
    uint8_t                   m_fontSize = 0;
    uint8_t                   m_lineHight = 0;
    uint8_t                   m_browseOnRelease = 0;
    uint8_t                   m_itemListPos = 0;
    int8_t                    m_currDLNAsrvNr = -1;
    int16_t                   m_currItemNr[10] = {0};
    int16_t                   m_viewPoint = 0;
    uint16_t                  m_dlnaMaxItems = 0;
    uint32_t                  m_bgColor = 0;
    bool                      m_enabled = false;
    bool                      m_clicked = false;
    bool                      m_state = false;
    bool                      m_isAudio = false;
    bool                      m_isURL = false;
    char*                     m_name = NULL;
    char*                     m_pathBuff = NULL;
    char*                     m_chptr = NULL;
    char*                     m_buff = NULL;
    DLNA_Client::dlnaServer_t m_dlnaServer;
    DLNA_Client::srvContent_t m_srvContent;
    DLNA_Client*              m_dlna;
    dlnaHistory*              m_dlnaHistory = NULL;
    releasedArg               m_ra;

public:
    dlnaList(const char* name, DLNA_Client *dlna, dlnaHistory* dh, uint8_t dhSize){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("dlnaList");
        m_buff = x_ps_malloc(512);
        m_dlna    = dlna;
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
        m_ra.arg1 = NULL;
        m_ra.arg2 = NULL;
        m_ra.val1 = 0;
        m_ra.val2 = 0;
        m_dlnaHistory = dh;
        for(uint8_t i = 0; i < 10; i++) m_currItemNr[i] = 0;
    }
    ~dlnaList(){
        x_ps_free(&m_name);
        x_ps_free(&m_buff);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_fontSize = fontSize;
        m_enabled = false;
        m_lineHight = m_h / 10;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(int8_t number, DLNA_Client::dlnaServer_t dlnaServer, DLNA_Client::srvContent_t srvContent, uint8_t* dlnaLevel,  uint16_t maxItems){
        m_browseOnRelease = 0;
        m_dlnaServer = dlnaServer;
        m_srvContent = srvContent;
        m_dlnaLevel  = dlnaLevel;
        if(m_dlnaLevel == 0) m_currDLNAsrvNr = number;
        m_clicked = false;
        m_enabled = true;
        m_dlnaMaxItems = maxItems;
        m_dlnaHistory[0].maxItems = m_dlna->getNrOfServers();
        dlnaItemsList();
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){ // called every tine if x or y has changed
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_clicked == false){m_oldX = x; m_oldY = y;}
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(uint16_t x, uint16_t y){
        if(!m_enabled) return false;
        if(!m_clicked) return false;

        hasReleased(x - m_x, y - m_y);
        m_clicked = false;

        if(m_chptr || (m_itemListPos == 0 && (*m_dlnaLevel) > 0)) {
            drawItem(m_itemListPos, true);
            m_chptr = NULL;
            vTaskDelay(300);
        }

        if(m_browseOnRelease == 0){;}                                                                                                              // file
        if(m_browseOnRelease == 1){(*m_dlnaLevel) ++; m_dlna->browseServer(m_currDLNAsrvNr, "0", 0 , 9);}                                          // get serverlist
        if(m_browseOnRelease == 2){(*m_dlnaLevel) --; m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, 0 , 9);}            // previous level
        if(m_browseOnRelease == 3){(*m_dlnaLevel) ++; m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, 0 , 9);}            // folder, next level
        if(m_browseOnRelease == 4){                   m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, m_viewPoint, 9);}   // scroll up / down

        m_browseOnRelease = 0;
        m_oldX = 0; m_oldY = 0;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        m_ra.val1 = 0;
        return true;
    }

