schreibfaul1/ESP32-MiniWebRadio/src/common.h
private:
    void dlnaItemsList(){
        uint8_t pos = 0;
        myList.setMode(DLNA);
        myList.clearList();
        myList.drawLine(0, m_dlnaHistory[*m_dlnaLevel].name, NULL, ANSI_ESC_ORANGE);
        tft.setTextColor(TFT_WHITE);
        for(pos = 1; pos < 10; pos++) {
            if(pos == 1 && m_viewPoint > 0)                      { myList.drawTriangeUp();}
            if(pos == 9 && m_viewPoint + 9 < m_dlnaMaxItems - 1) { myList.drawTriangeDown();}
            if(*m_dlnaLevel == 0 && pos > m_dlnaServer.size) {/* log_e("pos too high %i", pos);*/ break;}   // guard
            if(*m_dlnaLevel >  0 && pos > m_srvContent.size) {/* log_e("pos too high %i", pos);*/ break;}   // guard
            drawItem(pos);
        }
        sprintf(m_buff, "%i-%i/%i", m_viewPoint + 1, m_viewPoint + (pos - 1), m_dlnaMaxItems); // shows the current items pos e.g. "30-39/210"
        tft.setTextColor(TFT_ORANGE);
        tft.writeText(m_buff, 10, m_y, m_w - 10, m_lineHight, TFT_ALIGN_RIGHT, TFT_ALIGN_CENTER, true, true);

        return;
    }

    void drawItem(int8_t pos, bool selectedLine = false){ // pos 0 is parent, pos 1...9 are itens, selectedLine means released (ok)
        if(pos < 0 || pos > 9) {log_e("pos oor %i", pos); return;}                                          // guard
        if(*m_dlnaLevel == 0 && pos > m_dlnaServer.size) {/* log_e("pos too high %i", pos);*/ return;}   // guard
        if(*m_dlnaLevel >  0 && pos > m_srvContent.size) {/* log_e("pos too high %i", pos);*/ return;}   // guard
        char extension[15] = {0};
        char dummy[] = "";
        bool isAudio = false;
        bool isURL = false;
        const char *item = dummy, *duration = dummy, *itemURL = dummy, *color = ANSI_ESC_WHITE; (void)itemURL;
        int32_t itemSize = 0;
        int16_t childCount = 0;
        if(pos == 0){
            if(pos + m_viewPoint == m_currItemNr[*m_dlnaLevel] + 1) color = ANSI_ESC_MAGENTA; else color = ANSI_ESC_ORANGE;
            if(selectedLine) color = ANSI_ESC_CYAN;
            myList.drawLine(pos, m_dlnaHistory[*m_dlnaLevel].name, "", "", color, 1);
            return;
        }
        if(*m_dlnaLevel == 0) {
            if(m_dlnaServer.friendlyName[pos - 1]) item = m_dlnaServer.friendlyName[pos - 1];
        }
        else {
            if(m_srvContent.title[pos - 1]) item = m_srvContent.title[pos - 1];
            itemSize = m_srvContent.itemSize[pos - 1];
            childCount = m_srvContent.childCount[pos -1];
            if(m_srvContent.duration[pos - 1]) duration = m_srvContent.duration[pos - 1];
            isAudio = m_srvContent.isAudio[pos - 1];
            if(startsWith(m_srvContent.itemURL[pos -1], "http")) {isURL = true; itemURL = m_srvContent.itemURL[pos -1];}
        }

        if((pos - 1) + m_viewPoint == m_currItemNr[*m_dlnaLevel]){ color = ANSI_ESC_MAGENTA;}
        else if(isURL && isAudio)                                { color = ANSI_ESC_YELLOW;}
        else                                                     { color = ANSI_ESC_WHITE;}
        if(selectedLine)                                         { color = ANSI_ESC_CYAN;}

        if(childCount)        {sprintf(extension, "%i", childCount);}
        if(itemSize)          {sprintf(extension, "%li", itemSize);}
        if(duration[0] != '?'){if(strcmp(duration, "0:00:00") != 0) sprintf(extension, "%s", duration);}
        myList.drawLine(pos, item, extension, itemURL, color, 1);
    }

    void hasReleased(uint16_t x, uint16_t y){

        bool guard1 = false; if(m_dlnaServer.friendlyName.size() > (m_itemListPos -1)) guard1 = true;
        bool guard2 = false; if(m_srvContent.itemURL.size() >  (m_itemListPos - 1)) guard2 = true;
        bool guard3 = false; if(m_srvContent.title.size() > (m_itemListPos - 1)) guard3 = true;

        m_itemListPos = y / (m_h / 10);

        if(m_oldY && (m_oldY + 7 * m_lineHight < y)) {     // fast wipe down
            m_ra.val1 = 0;
            if(m_viewPoint == 0) goto exit;
            if     (m_viewPoint > 36) m_viewPoint -= 36;
            else    m_viewPoint = 0;
            m_browseOnRelease = 4;
            m_chptr = NULL;
            goto exit;
        }

        if(m_oldY && (m_oldY + 1 * m_lineHight < y)) {     // normal wipe down
            m_ra.val1 = 0;
            if(m_viewPoint == 0) goto exit;
            if(m_viewPoint >  9) m_viewPoint -= 9;
            else m_viewPoint = 0;
            m_browseOnRelease = 4;
            m_chptr = NULL;
            goto exit;
        }

        if(m_oldY && (m_oldY - 8 * m_lineHight > y)) {     // fast wipe up
            m_ra.val1 = 0;
            if(m_viewPoint + 9 >= m_dlnaMaxItems - 1) goto exit;
            int16_t diff = (m_dlnaMaxItems - 1) - (m_viewPoint + 9);
            if(diff >= 36) m_viewPoint += 36;
            else m_viewPoint += diff;
            m_browseOnRelease = 4;
            m_chptr = NULL;
            goto exit;
        }

        if(m_oldY && (m_oldY - 2 * m_lineHight > y)) {      // normal wipe up
            m_ra.val1 = 0;
            if(m_viewPoint + 9 >= m_dlnaMaxItems - 1) goto exit;
            m_viewPoint += 9;
            m_browseOnRelease = 4;
            m_chptr = NULL;
            goto exit;
        }

        if(m_itemListPos == 0){ // previous level, content list
            if(*m_dlnaLevel == 0) goto exit;
            m_viewPoint = 0;
            m_browseOnRelease = 2;
            goto exit;
        }

        if(guard1){ // server list
            if(*m_dlnaLevel == 0){
                m_chptr = m_dlnaServer.friendlyName[m_itemListPos - 1];
                m_currDLNAsrvNr = m_itemListPos - 1;
                m_currItemNr[*m_dlnaLevel]= m_itemListPos - 1;
                x_ps_free(&m_dlnaHistory[(*m_dlnaLevel) + 1].name);
                if(m_dlnaServer.friendlyName[m_itemListPos - 1] == NULL){
                    log_e("invalid pointer in dlna history");
                    m_dlnaHistory[(*m_dlnaLevel) + 1].name = strdup((char*)"dummy");
                    goto exit;
                }
                m_dlnaHistory[(*m_dlnaLevel) + 1].name = strdup(m_dlnaServer.friendlyName[m_itemListPos - 1]);
                m_browseOnRelease = 1;
                goto exit;
            }
        }

