schreibfaul1/ESP32-MiniWebRadio/src/common.h
        if(guard2){ // is file
            if(startsWith(m_srvContent.itemURL[m_itemListPos - 1], "http")){
                m_currItemNr[*m_dlnaLevel]= m_itemListPos - 1;
                if(m_srvContent.isAudio[m_itemListPos - 1]){
                    sprintf(m_buff, "%s",m_srvContent.title[m_itemListPos - 1]);
                    m_chptr = m_buff;
                    m_ra.arg1 = m_srvContent.itemURL[m_itemListPos - 1]; // url --> connecttohost()
                    m_ra.arg2 = m_srvContent.title[m_itemListPos - 1];   // filename --> showFileName()
                    if(m_ra.arg1 && m_ra.arg2) m_ra.val1 = 1;
                    m_browseOnRelease = 0;
                    goto exit;
                }
            }
        }

        if(guard3){ // is folder
            m_viewPoint = 0;
            sprintf(m_buff, "%s (%d)",m_srvContent.title[m_itemListPos - 1], m_srvContent.childCount[m_itemListPos - 1]);
            m_currItemNr[*m_dlnaLevel]= m_itemListPos - 1;
            m_chptr = m_buff;
            x_ps_free(&m_dlnaHistory[(*m_dlnaLevel) + 1].objId);
            m_dlnaHistory[   (*m_dlnaLevel) + 1].objId = strdup(m_srvContent.objectId[m_itemListPos -1]);
            x_ps_free(&m_dlnaHistory[ (*m_dlnaLevel) + 1].name);
            m_dlnaHistory[(   *m_dlnaLevel) + 1].name = strdup(m_srvContent.title[m_itemListPos - 1]);
            m_browseOnRelease = 3;
            goto exit;
        }
        // log_i("at this position is nothing to do");
exit:
        return;
    }
public:
    void prevPage(){ // from IR control
        if(m_viewPoint == 0) return;
        if     (m_viewPoint > 9) m_viewPoint -= 9;
        else    m_viewPoint = 0;
        if(m_currItemNr[*m_dlnaLevel] > 9){m_currItemNr[*m_dlnaLevel] -= 9;}
        else{m_currItemNr[*m_dlnaLevel] = 0;}
        m_chptr = NULL;
        m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, m_viewPoint, 9);
        m_dlna->loop();
        while(m_dlna->getState() != m_dlna->IDLE) {m_dlna->loop(); vTaskDelay(10);} // wait of browse rady
        m_srvContent = m_dlna->getBrowseResult();
        dlnaItemsList();
        drawItem(m_currItemNr[*m_dlnaLevel] + 0 - m_viewPoint + 1);  // make magenta
        return;
    }
    void nextPage(){ // from IR control
        if(m_dlnaMaxItems <= m_viewPoint + 9) return;
        if(m_dlnaMaxItems - 9 > m_viewPoint){m_viewPoint += 9;}
        else{m_viewPoint = m_dlnaMaxItems - 9;}
        if( m_dlnaMaxItems - 9 > m_currItemNr[*m_dlnaLevel]){m_currItemNr[*m_dlnaLevel] += 9;}
        else{m_currItemNr[*m_dlnaLevel] = m_dlnaMaxItems - 1;}
        m_chptr = NULL;
        m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, m_viewPoint, 9);
        m_dlna->loop();
        while(m_dlna->getState() != m_dlna->IDLE) {m_dlna->loop(); vTaskDelay(10);} // wait of browse rady
        m_srvContent = m_dlna->getBrowseResult();
        dlnaItemsList();
        drawItem(m_currItemNr[*m_dlnaLevel] + 0 - m_viewPoint + 1);  // make magenta
        return;
    }
    void prevItem(){ // from IR control
        if(*m_dlnaLevel == 0 && m_currItemNr[*m_dlnaLevel] == 0) return;
        if(m_currItemNr[*m_dlnaLevel] < 0) return;
        if(m_currItemNr[*m_dlnaLevel] < m_viewPoint) {
            m_viewPoint -= 9;
            if(m_viewPoint < 0) m_viewPoint = 0;
            m_chptr = NULL;
            m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, m_viewPoint, 9);
            m_dlna->loop();
            while(m_dlna->getState() != m_dlna->IDLE) {m_dlna->loop(); vTaskDelay(10);} // wait of browse ready
            m_srvContent = m_dlna->getBrowseResult();
            dlnaItemsList();
            return;
        }
        m_currItemNr[*m_dlnaLevel]--;
        drawItem(m_currItemNr[*m_dlnaLevel] + 0 - m_viewPoint + 1);  // make magenta
        drawItem(m_currItemNr[*m_dlnaLevel] + 1 - m_viewPoint + 1);  // std colour
    }
    void nextItem(){ // from IR control
        if(m_dlnaMaxItems == m_currItemNr[*m_dlnaLevel] - 1) return;
        if(m_currItemNr[*m_dlnaLevel] == m_dlnaMaxItems - 1) return;
        m_currItemNr[*m_dlnaLevel]++;
        if(m_currItemNr[*m_dlnaLevel] >= m_viewPoint + 9) {
            m_viewPoint += 9;
            m_chptr = NULL;
            m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, m_viewPoint, 9);
            m_dlna->loop();
            while(m_dlna->getState() != m_dlna->IDLE) {m_dlna->loop(); vTaskDelay(10);} // wait of browse rady
            m_srvContent = m_dlna->getBrowseResult();
            dlnaItemsList();
            return;
        }
        drawItem(m_currItemNr[*m_dlnaLevel] + 0 - m_viewPoint + 1);  // make magenta
        drawItem(m_currItemNr[*m_dlnaLevel] - 1 - m_viewPoint + 1);  // std colour
    }
    const char* getSelectedURL(){ // ok from IR
        if(*m_dlnaLevel == 0){ //------------------------------------------------------------------------------------------------------- choose server
            // log_e("server %s", m_dlnaServer.friendlyName[m_currItemNr[0]]);
            m_chptr = m_dlnaServer.friendlyName[m_currItemNr[0]];
            m_currDLNAsrvNr = m_currItemNr[0];
            m_currItemNr[*m_dlnaLevel] = m_currItemNr[0];
            drawItem(m_currItemNr[*m_dlnaLevel] + m_viewPoint + 1, true);  // make cyan
            vTaskDelay(300);
            (*m_dlnaLevel) ++;
            x_ps_free(&m_dlnaHistory[*m_dlnaLevel].name);
            if(m_dlnaServer.friendlyName[m_currItemNr[0]] == NULL){
                log_e("invalid pointer in dlna history");
                m_dlnaHistory[*m_dlnaLevel].name = strdup((char*)"dummy");
                return NULL;
            }
            m_dlnaHistory[*m_dlnaLevel].name = strdup(m_dlnaServer.friendlyName[m_currItemNr[0]]);
            m_dlna->browseServer(m_currDLNAsrvNr, "0", 0 , 9);
            m_dlna->loop();
            while(m_dlna->getState() != m_dlna->IDLE) {m_dlna->loop(); vTaskDelay(10);} // wait of browse rady
            m_srvContent = m_dlna->getBrowseResult();
            m_dlnaMaxItems = m_dlna->getTotalMatches();
            m_dlnaHistory[*m_dlnaLevel].maxItems = m_dlnaMaxItems; // level 1
            // log_e("m_dlnaMaxItems %i, level %i", m_dlnaMaxItems, (*m_dlnaLevel));
            dlnaItemsList();
            return NULL;
        }
        if(m_currItemNr[*m_dlnaLevel] + 1 == m_viewPoint) { // DLNA history, parent item ---------------------------------------------- back to parent
            // log_e("%s", m_dlnaHistory[*m_dlnaLevel].name);
            drawItem(0, true);  // make cyan
            vTaskDelay(300);
            (*m_dlnaLevel) --;
            m_dlnaMaxItems = m_dlnaHistory[*m_dlnaLevel].maxItems;
            m_viewPoint  = 0;
            m_currItemNr[*m_dlnaLevel] = 0;
            m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, m_viewPoint, 9);
            m_dlna->loop();
            while(m_dlna->getState() != m_dlna->IDLE) {m_dlna->loop(); vTaskDelay(10);} // wait of browse rady
            m_srvContent = m_dlna->getBrowseResult();
            dlnaItemsList();
            return NULL;
        }
        if(strcmp(m_srvContent.itemURL[m_currItemNr[*m_dlnaLevel] - m_viewPoint], "?") == 0){ // --------------------------------------- choose folder
            drawItem(m_currItemNr[*m_dlnaLevel] - m_viewPoint + 1, true);  // make cyan
            vTaskDelay(300);
            (*m_dlnaLevel) ++;
            m_currItemNr[*m_dlnaLevel] = 0;
            x_ps_free(&m_dlnaHistory[*m_dlnaLevel].objId);
            m_dlnaHistory[*m_dlnaLevel].objId = strdup(m_srvContent.objectId[m_currItemNr[(*m_dlnaLevel) - 1] - m_viewPoint]);
            x_ps_free(&m_dlnaHistory[*m_dlnaLevel].name);
            m_dlnaHistory[*m_dlnaLevel].name = strdup(m_srvContent.title[m_currItemNr[(*m_dlnaLevel) - 1] - m_viewPoint]);
            m_viewPoint = 0;
            m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, 0 , 9);
            m_dlna->loop();
            while(m_dlna->getState() != m_dlna->IDLE) {m_dlna->loop(); vTaskDelay(10);} // wait of browse rady
            m_srvContent = m_dlna->getBrowseResult();
            m_dlnaMaxItems = m_dlna->getTotalMatches();
            m_dlnaHistory[*m_dlnaLevel].maxItems = m_dlnaMaxItems;
            // log_e("m_dlnaMaxItems %i, level %i", m_dlnaMaxItems, (*m_dlnaLevel)); // level 2, 3, 4...
            dlnaItemsList();
            if(!m_dlnaMaxItems) { // folder is empty
                m_currItemNr[*m_dlnaLevel]--;
                drawItem(m_currItemNr[*m_dlnaLevel] + 0 - m_viewPoint + 1);  // make magenta
            }
            return NULL;
        }
        if(startsWith(m_srvContent.itemURL[m_currItemNr[*m_dlnaLevel] - m_viewPoint], "http") != 0){ // ---------------------------------- choose file
            drawItem(m_currItemNr[*m_dlnaLevel] - m_viewPoint + 1, true);  // make cyan
            vTaskDelay(300);
            return m_srvContent.itemURL[m_currItemNr[*m_dlnaLevel] - m_viewPoint];
        }
        return NULL;
    }
    const char* getSelectedTitle(){
            return m_srvContent.title[m_currItemNr[*m_dlnaLevel] - m_viewPoint];
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
/*
  ———————————————————————————————————————————————————————
  | Audio Files                     Vol11    15:32:18   |
  | /audiofiles/myPlaylist/                    1-9/11   |           <- parent folder  m_curAudioFileNr = -1
  |   320_test.mpr 9610227                              |           <--               m_curAudioFileNr - m_viewpos = 0
  |   If_I_Had_a_Chicken_mono_mp3 1591510               |           <--
  |   If_I_Had_a_Chicken_mono_16bit.wav 13257580        |           <--
  |   If_I_Had_a_Chicken_mono_8bit.wav 6628972          |           <--
  |   If_I_Had_a_Chicken_stereo_mp3 6012554             |           <--
  |   If_I_Had_a_Chicken_stereo_16bit.wav 26514608      |           <--
  |   If_I_Had_a_Chicken_stereo_8bit.wav 1327260        |           <--
  |   beep.mp3 75302                                    |           <--
  |     click.mp3 3360                                  |           <--               m_curAudioFileNr - m_viewpos = 8
  | 003   0:00    128K              IP:192.168.178.24   |
  ———————————————————————————————————————————————————————
*/

class fileList : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    int16_t     m_oldX = 0;
    int16_t     m_oldY = 0;
    uint8_t     m_lineHight = 0;
    uint8_t     m_browseOnRelease = 0;
    uint16_t    m_fileListPos = 0;
    int16_t    m_curAudioFileNr = 0;
    uint16_t    m_viewPos = 0;
    uint8_t     m_fontSize = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_curAudioFolder = NULL;
    char*       m_curAudioPath = NULL;
    char*       m_curAudioName = NULL;
    char*       m_fileItemsPos = NULL;
    const char* m_rootColor = ANSI_ESC_LIGHTBROWN;
    const char* m_folderColor = ANSI_ESC_ORANGE;
    const char* m_fileColor = ANSI_ESC_WHITE;
    const char* m_selectColor = ANSI_ESC_CYAN;
    const char* m_irColor = ANSI_ESC_MAGENTA;
    const char* m_currentColor = ANSI_ESC_MAGENTA;
    releasedArg m_ra;
public:
    fileList(const char* name){
        register_object(this);
        if(name) m_name  = x_ps_strdup(name);
        else     m_name  = x_ps_strdup("fileList");
        m_fileItemsPos   = x_ps_malloc(30);
        m_curAudioFolder = x_ps_malloc(1024);
        m_curAudioPath   = x_ps_malloc(1024);
        m_curAudioName   = x_ps_malloc(1024);
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_ra.arg1 = NULL;
        m_ra.arg2 = NULL;
        m_ra.val1 = 0;
        m_ra.val2 = 0;
    }
    ~fileList(){
        x_ps_free(&m_name);
        x_ps_free(&m_fileItemsPos);
        x_ps_free(&m_curAudioFolder);   //   /audiofiles/folder1
        x_ps_free(&m_curAudioName);     //   song.mp3
        x_ps_free(&m_curAudioPath);     //   /audiofiles/folder1/song.mp3
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_lineHight = m_h / 10;
        m_fontSize = fontSize;
        m_enabled = false;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(const char* cur_AudioFolder, uint16_t curAudioFileNr){
        m_browseOnRelease = 0;
        m_clicked = false;
        m_enabled = true;
        if(!cur_AudioFolder) {log_w("cur_AudioFolder set to /audiofiles/"); strcpy(m_curAudioFolder, (char*)"/audiofiles/");}
        else if(cur_AudioFolder != m_curAudioFolder) strcpy(m_curAudioFolder, cur_AudioFolder); // cur_AudioFolder can have the same address as m_curAudioFolder
        m_curAudioFileNr = curAudioFileNr;
        _SD_content.listFilesInDir(m_curAudioFolder, true, false);
        if(m_curAudioFileNr >= _SD_content.getSize()) m_curAudioFileNr = _SD_content.getSize(); // guard
        m_viewPos = calculateDisplayStartPosition(_SD_content.getSize(), m_curAudioFileNr);     // calculate viewPos
        audioFileslist(m_viewPos);
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_clicked == false){m_oldX = x; m_oldY = y;}
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(uint16_t x, uint16_t y){
        if(!m_enabled) return false;
        if(!m_clicked) return false;

        hasReleased(x - m_x, y - m_y);
        m_clicked = false;

        char* fileName = NULL;

        if(m_browseOnRelease == 1)  {   if(m_viewPos + 9 >= _SD_content.getSize()) { goto exit; }                                   // wipe up
                                        else                     {m_viewPos += 9; m_ra.val1 = 1;}
                                        audioFileslist(m_viewPos);
                                    }
        if(m_browseOnRelease == 2)  {   if(m_viewPos == 0) { goto exit; }                                                           // wipe down
                                        if(m_viewPos >  9) {m_viewPos -= 9; m_ra.val1 = 1;}
                                        else               {m_viewPos  = 0; m_ra.val1 = 1;}
                                        audioFileslist(m_viewPos);
                                    }
        if(m_browseOnRelease == 3)  {   //log_e("m_curAudioFolder = %s", m_curAudioFolder);                                         // previous folder
                                        if(!strcmp(m_curAudioFolder, "/audiofiles/")) goto exit; // is already the root
                                        tft.setTextColor(TFT_CYAN);
                                        tft.setFont(m_fontSize);
                                        tft.writeText(m_curAudioFolder, 10, m_y, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
                                        int lastSlash = rfind(m_curAudioFolder, '/');
                                        if (lastSlash != -1) { // Look for the penultimate '/' before the position of the last
                                            int secondLastSlash = rfind(m_curAudioFolder, '/', lastSlash - 1);
                                            if(secondLastSlash != -1) m_curAudioFolder[secondLastSlash + 1] = '\0';
                                        }
                                        log_e("m_curAudioFolder = %s", m_curAudioFolder);
                                        m_curAudioFileNr = 0;
                                        m_viewPos = 0;
                                        _SD_content.listFilesInDir(m_curAudioFolder, true, false);
                                        m_ra.val1 = 2;
                                        m_ra.val2 = m_curAudioFileNr;
                                        m_ra.arg1 = m_curAudioFolder;
                                    }
        if(m_browseOnRelease == 4)  {   m_viewPos += m_fileListPos;                                                                 // next folder
                                        int16_t idx = m_viewPos -1;
                                        tft.setTextColor(TFT_CYAN);
                                        tft.setFont(m_fontSize);
                                        tft.writeText(_SD_content.getColouredSStringByIndex(idx), 20, m_y + (m_fileListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
                                        strcpy(m_curAudioFolder, _SD_content.getFilePathByIndex(idx));
                                        m_curAudioFileNr = 0;
                                        m_viewPos = 0;
                                        _SD_content.listFilesInDir(m_curAudioFolder, true, false);
                                        m_ra.val1 = 2;                     // isfolder
                                        m_ra.val2 = m_viewPos;
                                        m_ra.arg1 = m_curAudioFolder;
                                    }
        if(m_browseOnRelease == 5)  {   m_viewPos += m_fileListPos;                                                                 // play file
                                        tft.setTextColor(TFT_CYAN);
                                        tft.setFont(m_fontSize);
                                        tft.writeText(m_curAudioName, 20, m_y + (m_fileListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
                                        vTaskDelay(300 / portTICK_PERIOD_MS);
                                        m_ra.arg1 = m_curAudioFolder;      // fileFolder
                                        m_ra.arg2 = m_curAudioName;        // fileName
                                        m_ra.arg3 = m_curAudioPath;        // filePath
                                        m_ra.val1 = 3;                     // isfile
                                        m_ra.val2 = m_viewPos - 1;         // fileNr (is curAudioFileNr)
                                    }
    exit:
        m_browseOnRelease = 0;
        m_oldX = 0; m_oldY = 0;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        x_ps_free(&fileName);
        m_ra.val1 = 0;
        m_ra.arg1 = NULL;
        return true;
    }

    void prevPage(){ // from IR control
        if(m_viewPos == 0) return;
        if(m_viewPos > 9) {
            m_viewPos -= 9;
            m_curAudioFileNr -= 9;
        }
        else {
            m_curAudioFileNr -= m_viewPos;
            m_viewPos = 0;
        }
        audioFileslist(m_viewPos);
        return;
    }
    void nextPage(){ // from IR control
        if(m_viewPos + 9 <= _SD_content.getSize() - 1) {
            m_viewPos += 9;
            m_curAudioFileNr += 9;
            if(m_curAudioFileNr > _SD_content.getSize() - 1) m_curAudioFileNr = _SD_content.getSize() - 1;
            audioFileslist(m_viewPos);
            return;
        }
    }

    void prevFile(){ // from IR control
        if(m_curAudioFileNr < 0) return;
        if(m_curAudioFileNr && m_curAudioFileNr - m_viewPos == 0) {
            if(m_viewPos >= 9) m_viewPos -= 9; else m_viewPos = 0;
            m_curAudioFileNr--; audioFileslist(m_viewPos); return;
        }
        int pos = m_curAudioFileNr - m_viewPos + 1;
        const char* color = m_fileColor;                               // assume is file
        if(_SD_content.isDir(m_curAudioFileNr)) color = m_folderColor; // is folder
        myList.colourLine(pos, color);
        m_curAudioFileNr--;
        myList.colourLine(pos - 1, m_irColor);
    }
    void nextFile(){ // from IR control
        if(m_curAudioFileNr == _SD_content.getSize() - 1) return;
        if(m_curAudioFileNr - m_viewPos == 8) {
            if(m_viewPos + 9 < _SD_content.getSize()) m_viewPos += 9; else m_viewPos = _SD_content.getSize() - 1;
            m_curAudioFileNr++; audioFileslist(m_viewPos); return;
        }
        const char* color;
        int pos = m_curAudioFileNr - m_viewPos + 1;
        if(m_curAudioFileNr == -1){                 color = m_rootColor;}  // is root dir
        else{
            if(_SD_content.isDir(m_curAudioFileNr)) color = m_folderColor; // is folder
            else                                    color = m_fileColor;   // is file
        }
        myList.colourLine(pos, color);
        m_curAudioFileNr++;
        myList.colourLine(pos + 1, m_irColor);
    }
    const char* getSelectedFile(){
        if(m_curAudioFileNr == -1) { // get parent folder
            if(!strcmp(m_curAudioFolder, "/audiofiles/")) return NULL; // is already the root
            tft.setTextColor(TFT_CYAN);
            tft.setFont(m_fontSize);
            tft.writeText(m_curAudioFolder, 10, m_y, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
            vTaskDelay(300 / portTICK_PERIOD_MS);
            int lastSlash = rfind(m_curAudioFolder, '/');
            if (lastSlash != -1) { // Look for the penultimate '/' before the position of the last
                int secondLastSlash = rfind(m_curAudioFolder, '/', lastSlash - 1);
                if(secondLastSlash != -1) m_curAudioFolder[secondLastSlash + 1] = '\0';    // previous folder
            }
            m_curAudioFileNr = 0;
            m_viewPos = 0;
            _SD_content.listFilesInDir(m_curAudioFolder, true, false);
            show(m_curAudioFolder, 0);
            return NULL;
        }
        if(_SD_content.isDir(m_curAudioFileNr)){ // is child folder
            tft.setTextColor(TFT_CYAN);
            tft.setFont(m_fontSize);
            tft.writeText(_SD_content.getColouredSStringByIndex(m_curAudioFileNr), 20, m_y + (m_curAudioFileNr + 1) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
            vTaskDelay(300 / portTICK_PERIOD_MS);
            strcpy(m_curAudioPath, _SD_content.getFilePathByIndex(m_curAudioFileNr));
            show(m_curAudioPath, 0);
            return NULL;
        }
        tft.setTextColor(TFT_CYAN); // is file
        tft.setFont(m_fontSize);
        tft.writeText(_SD_content.getColouredSStringByIndex(m_curAudioFileNr), 20, m_y + (m_curAudioFileNr + 1) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
        vTaskDelay(300 / portTICK_PERIOD_MS);
        return _SD_content.getFilePathByIndex(m_curAudioFileNr);
    }
    const char* getSelectedFileName(){
        return _SD_content.getFileNameByIndex(m_curAudioFileNr);
    }
    const char* getSelectedFilePath(){
        myList.colourLine(m_curAudioFileNr - m_viewPos + 1, m_selectColor);
        vTaskDelay(300 / portTICK_PERIOD_MS);
        return _SD_content.getFilePathByIndex(m_curAudioFileNr);
    }
    uint16_t getSelectedFileNr(){
        return m_curAudioFileNr;
    }


