schreibfaul1/ESP32-MiniWebRadio/src/common.h
public:
    stationsList(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("stationsList");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
        m_ra.arg1 = NULL;
        m_ra.arg2 = NULL;
        m_ra.val1 = 0;
        m_ra.val2 = 0;
    }
    ~stationsList(){
        x_ps_free(&m_name);
        x_ps_free(&m_buff);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize, uint16_t* curStationNr){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_lineHight = m_h / 10;
        m_fontSize = fontSize;
        m_curSstationNr = curStationNr;
        m_enabled = false;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(){
        m_clicked = false;
        m_enabled = true;
        m_browseOnRelease = 0;
        stationslist(true);
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        hasClicked(x - m_x, y - m_y);
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;

        if(m_browseOnRelease == 1)  {   stationslist(false);                                             // wipe up
                                    }
        if(m_browseOnRelease == 2)  {   stationslist(false);                                             // wipe down
                                    }
        if(m_browseOnRelease == 3)  {   myList.getTxtByPos(m_stationListPos);                            // click
                                        myList.colourLine(m_stationListPos, ANSI_ESC_CYAN);
                                        vTaskDelay(300 / portTICK_PERIOD_MS);
                                        m_ra.val1 = myList.getNumberByPos(m_stationListPos);
                                    }
        m_browseOnRelease = 0;
        m_oldX = 0; m_oldY = 0;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        x_ps_free(&m_buff);
        m_ra.val1 = 0;
        m_ra.arg1 = NULL;
        return true;
    }
private:
    void stationslist(bool first){
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(first){
            if(staMgnt.getSumStations() <= 10) m_firstStationsLineNr = 0;
            else  if(*m_curSstationNr < 5) m_firstStationsLineNr = 0;
            else if(*m_curSstationNr +5 <= staMgnt.getSumStations()) m_firstStationsLineNr = *m_curSstationNr - 5;
            else m_firstStationsLineNr = staMgnt.getSumStations() - 10;
            m_curStaNrCpy = *m_curSstationNr;
            if(m_curStaNrCpy == 0) m_curStaNrCpy = 1;
        }
        myList.clearList();
        myList.setMode(RADIO);

        for(uint8_t pos = 0; pos < 10; pos++) {
            if(pos + m_firstStationsLineNr + 1 > staMgnt.getSumStations()) break;
            if(staMgnt.getStationFav(pos + m_firstStationsLineNr + 1) == '*') m_colorToDraw = ANSI_ESC_WHITE;   // is fav station
            else                                                              m_colorToDraw = ANSI_ESC_GREY;    // is not a fav station
            if((pos + m_firstStationsLineNr + 1) == m_curStaNrCpy)            m_colorToDraw = ANSI_ESC_MAGENTA; // is the current station

            m_staNameToDraw = staMgnt.getStationName(pos + m_firstStationsLineNr + 1);                          // the station name
            m_staNrToDraw = pos + m_firstStationsLineNr + 1;                                                    // the station number
            myList.drawLine(pos, m_staNameToDraw, NULL, NULL, m_colorToDraw, m_staNrToDraw);
        }
        xSemaphoreGive(mutex_display);
    }
    void hasClicked(uint16_t x, uint16_t y){
        m_stationListPos = y / (m_h / 10);
        if(m_oldY && (m_oldY + 2 * m_lineHight < y)) { // wipe up
            if(m_browseOnRelease != 1){
                m_browseOnRelease = 1;
                if(m_firstStationsLineNr == 0) {m_browseOnRelease = 0; return;} // nothing to do
                else if(m_firstStationsLineNr < 10) m_firstStationsLineNr = 0;
                else m_firstStationsLineNr -= 9;
            }
            return;
        }

        if(m_oldY && (m_oldY - 2 * m_lineHight > y)) { // wipe down
            if(m_browseOnRelease != 2){
                m_browseOnRelease = 2;
                if(m_firstStationsLineNr + 10 >= staMgnt.getSumStations()) {m_browseOnRelease = 0; return;} // nothing to do
                 else m_firstStationsLineNr += 9;
            }
            return;
        }
        if(myList.getNumberByPos(m_stationListPos) == -1) return;
        if(m_oldX || m_oldY) return;
        m_oldX = x; m_oldY = y;
        m_browseOnRelease = 3;  // pos has clicked
        return;
    }
public:
    void prevPage(){ // from IR control
        if(m_firstStationsLineNr == 0) {return;} // nothing to do
        else if(m_firstStationsLineNr < 10) {m_curStaNrCpy -=  m_firstStationsLineNr;  m_firstStationsLineNr = 0;}
        else {m_firstStationsLineNr -= 9; m_curStaNrCpy -= 9;}
        stationslist(false);
    }
    void nextPage(){ // from IR control
        if(m_firstStationsLineNr + 10 >= staMgnt.getSumStations()) {m_browseOnRelease = 0; return;} // nothing to do
        else {m_firstStationsLineNr += 9; m_curStaNrCpy += 9; if(m_curStaNrCpy > staMgnt.getSumStations()) m_curStaNrCpy = staMgnt.getSumStations();}
        stationslist(false);
    }
    void prevStation(){ // from IR control
        if(m_curStaNrCpy < 2) return;
        int8_t pos = m_curStaNrCpy - m_firstStationsLineNr - 1;
        if(pos < 0) return;
        if(pos == 0) { // prev page
            if(m_firstStationsLineNr > 8) m_firstStationsLineNr -= 9;
            else m_firstStationsLineNr = 0;
            m_curStaNrCpy--;
            stationslist(false);
            return;
        }
        myList.colourLine(pos,staMgnt.getStationFav(m_curStaNrCpy) == '*'? ANSI_ESC_WHITE : ANSI_ESC_GREY);
        myList.colourLine(pos - 1, ANSI_ESC_MAGENTA);
        m_curStaNrCpy--;
    }
    void nextStation(){ // from IR control
        if(m_curStaNrCpy >= staMgnt.getSumStations()) return;
        int8_t pos = m_curStaNrCpy - m_firstStationsLineNr - 1;
        if(pos > 9) return;
        if(pos == 9) { // next Page
            m_firstStationsLineNr += 9;
            m_curStaNrCpy++;
            stationslist(false);
            return;
        }
        myList.colourLine(pos,staMgnt.getStationFav(m_curStaNrCpy) == '*'? ANSI_ESC_WHITE : ANSI_ESC_GREY);
        myList.colourLine(pos + 1, ANSI_ESC_MAGENTA);
        m_curStaNrCpy++;
    }
    uint16_t getSelectedStation(){ // from IR control
        int8_t pos = m_curStaNrCpy - m_firstStationsLineNr;
        myList.colourLine(pos - 1, ANSI_ESC_CYAN);
        vTaskDelay(300 / portTICK_PERIOD_MS);
        return m_curStaNrCpy;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class vuMeter : public RegisterTable {
private:
    uint16_t    m_x = 0;
    uint16_t    m_y = 0;
    uint16_t    m_w = 0;
    uint16_t    m_h = 0;
    uint32_t    m_bgColor = TFT_BLACK;
    uint32_t    m_frameColor = TFT_DARKGREY;
    char*       m_name = NULL;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_backgroundTransparency = false;
    uint8_t     m_VUleftCh = 0;   // VU meter left channel
    uint8_t     m_VUrightCh = 0;  // VU meter right channel
    releasedArg m_ra;
    uint8_t     m_segm_w = 0;
    uint8_t     m_segm_h = 0;
    uint8_t     m_frameSize = 1;
    uint16_t    m_real_w = 0;
    uint16_t    m_real_h = 0;
public:
    vuMeter(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("vuMeter");
        m_bgColor = TFT_BLACK;
    }
    ~vuMeter(){
        x_ps_free(&m_name);
    }
    void begin(uint16_t x, uint16_t y, uint16_t real_w, uint16_t real_h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_real_w = real_w;
        m_real_h = real_h;
#if TFT_CONTROLLER < 2 // 320 x 240px
        m_segm_w = 9;
        m_segm_h = 7;
#else // 480 x 320px
        m_segm_w = 12;
        m_segm_h = 8;
#endif
        m_w = 2 *  m_segm_w  +  3 * m_frameSize;
        m_h = 12 * m_segm_h + 13 * m_frameSize;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool backgroundTransparency = false){
        m_backgroundTransparency = backgroundTransparency;
        m_enabled = true;
        m_clicked = false;
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_x, m_y, m_real_w, m_real_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_real_w, m_real_h, m_bgColor);
        }
        tft.drawRect(m_x, m_y, m_w, m_h, m_frameColor);
        for(uint8_t i = 0; i < 12; i++){
            drawRect(i, 0, 0);
            drawRect(i, 1, 0);
        }
        m_VUleftCh = 0;
        m_VUrightCh = 0;
    }
    void hide(){
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        m_enabled = false;
        }
    }
    void disable(){
        m_enabled = false;
    }
    void setBGcolor(uint32_t color){
        m_bgColor = color;
    }
    void update(uint16_t vum){
        if(!m_enabled) return;
        uint8_t left = map_l(vum >> 8, 0, 127, 0, 11);
        uint8_t right = map_l(vum & 0x00FF, 0, 127, 0, 11);

        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(left > m_VUleftCh) {
            for(int32_t i = m_VUleftCh; i < left; i++) { drawRect(i, 1, 1); }
        }
        if(left < m_VUleftCh) {
            for(int32_t i = left; i < m_VUleftCh; i++) { drawRect(i, 1, 0); }
        }
        m_VUleftCh = left;

        if(right > m_VUrightCh) {
            for(int32_t i = m_VUrightCh; i < right; i++) { drawRect(i, 0, 1); }
        }
        if(right < m_VUrightCh) {
            for(int32_t i = right; i < m_VUrightCh; i++) { drawRect(i, 0, 0); }
        }
        m_VUrightCh = right;
        xSemaphoreGive(mutex_display);
    }

    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
private:
    void drawRect(uint8_t pos, uint8_t ch, bool br) {
        uint16_t color = 0;
        uint16_t y_end = m_y + m_h -m_frameSize - m_segm_h;
        uint16_t xPos = m_x + m_frameSize + ch * (m_segm_w + m_frameSize);
        uint16_t yPos = y_end - pos * (m_frameSize + m_segm_h);
        if(pos > 11) return;
        switch(pos) {
            case 0 ... 6: // green
                br ? color = TFT_GREEN : color = TFT_DARKGREEN;
                break;
            case 7 ... 9: // yellow
                br ? color = TFT_YELLOW : color = TFT_DARKYELLOW;
                break;
            case 10 ... 11: // red
                br ? color = TFT_RED : color = TFT_DARKRED;
                break;
        }
        tft.fillRect(xPos, yPos, m_segm_w, m_segm_h, color);
    };
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class displayHeader : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    int8_t      m_rssi = 0;
    int8_t      m_old_rssi = -1;
    uint8_t     m_fontSize = 0;
    uint8_t     m_volume = 0;
    uint32_t    m_bgColor = TFT_BLACK;
    char*       m_name = NULL;
    char*       m_item = NULL;
    char        m_time[10] = {0};
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_backgroundTransparency = false;
    const char  m_rssiSymbol[5][18]     = {"/common/RSSI0.png", "/common/RSSI1.png", "/common/RSSI2.png", "/common/RSSI3.png", "/common/RSSI4.png"};
    const char  m_speakerSymbol[2][25]  = {"/common/Speaker_off.png", "/common/Speaker_on.png"};
    releasedArg m_ra;
    uint16_t    m_itemColor = TFT_GREENYELLOW;
    uint16_t    m_volumeColor = TFT_DEEPSKYBLUE;
    uint16_t    m_timeColor = TFT_GREENYELLOW;
#if TFT_CONTROLLER < 2 // 320 x 240px
    uint16_t    m_item_x = 0;
    uint16_t    m_item_w = 140;
    uint16_t    m_speaker_x =165;
    uint16_t    m_speaker_w = 26;
    uint16_t    m_volume_x = 195;
    uint16_t    m_volume_w = 26;
    uint16_t    m_time_x = 260;
    uint16_t    m_time_w = 60;
    uint8_t     m_time_pos[8] = {0, 9, 18, 21, 30, 39, 42, 51};  // display 320x240
    uint8_t     m_time_ch_w = 9;
    uint16_t    m_rssiSymbol_x = 225;
    uint16_t    m_rssiSymbol_w = 27;
#else // 480 x 320px
    uint16_t    m_item_x = 0;
    uint16_t    m_item_w = 240;
    uint16_t    m_speaker_x = 240;
    uint16_t    m_speaker_w = 38;
    uint16_t    m_volume_x = 285;
    uint16_t    m_volume_w = 40;
    uint8_t     m_time_pos[8] = {7, 20, 33, 40, 53, 66, 73, 86}; // display 480x320
    uint8_t     m_time_ch_w = 13;
    uint16_t    m_rssiSymbol_x = 335;
    uint16_t    m_rssiSymbol_w = 39;
    uint16_t    m_time_x = 380;
    uint16_t    m_time_w = 100;
#endif
public:
    displayHeader(const char* name, uint8_t fontSize){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("displayHeader");
        m_bgColor = TFT_BLACK;
        m_fontSize = fontSize;
    }
    ~displayHeader(){
        x_ps_free(&m_name);
        x_ps_free(&m_item);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w;
        m_h = h;
     }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool transparency = false){
        m_backgroundTransparency = transparency;
        m_enabled = true;
        m_clicked = false;
        m_old_rssi = -1;
        if(m_item) updateItem(m_item);
        else       updateItem("");
        updateVolume(m_volume);
        updateRSSI(m_rssi);
        updateTime("        ", true);
    }
    void hide(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    void disable(){
        m_enabled = false;
    }
    void setBGcolor(uint32_t color){
        m_bgColor = color;
    }
    void updateItem(const char* hl_item){// radio, clock, audioplayer...
        if(!m_enabled) return;
        if(!hl_item) log_e("hl_item is NULL");
        if(m_item && !strcmp(hl_item, m_item)) return; // nothing to do
        char* tmp = strdup(hl_item);
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_itemColor);
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_item_x, m_y, m_item_w, m_h);
        }
        else{
            tft.fillRect(m_item_x, m_y, m_item_w, m_h, m_bgColor);
        }
        tft.writeText(hl_item, m_item_x, m_y, m_item_w, m_h);
        x_ps_free(&m_item);
        m_item = strdup(tmp);
        x_ps_free(&tmp);
        xSemaphoreGive(mutex_display);
    }
    void setItemColor(uint16_t itemColor){
        m_itemColor = itemColor;
    }

    void speakerOnOff(bool on){
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_speaker_x, m_y, m_speaker_w, m_h);
        }
        drawImage(m_speakerSymbol[!on], m_speaker_x, m_y);
    }
    void updateVolume(uint8_t vol){
        m_volume = vol;
        if(!m_enabled) return;
        char buff[15];
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_volumeColor);
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_volume_x, m_y, m_volume_w, m_h);
        }
        else{
            tft.fillRect(m_volume_x, m_y, m_volume_w, m_h, m_bgColor);
        }
        itoa(m_volume, buff, 10);
        tft.writeText(buff, m_volume_x, m_y, m_volume_w, m_h, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true);
        xSemaphoreGive(mutex_display);
    }

    void updateRSSI(int8_t rssi, bool show = false){
        static int32_t old_rssi = -1;
        int8_t new_rssi = -1;
        if(rssi >= 0) return;
        m_rssi = rssi;
        if(m_rssi < -1)  new_rssi = 4;
        if(m_rssi < -50) new_rssi = 3;
        if(m_rssi < -65) new_rssi = 2;
        if(m_rssi < -75) new_rssi = 1;
        if(m_rssi < -85) new_rssi = 0;

        if(new_rssi != old_rssi) {
            old_rssi = new_rssi; // no need to draw a rssi icon if rssiRange has not changed
            if(ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO) {
                static int32_t tmp_rssi = 0;
                if((abs(rssi - tmp_rssi) > 4)) { SerialPrintfln("WiFI_info:   RSSI is " ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE " dB", rssi); }
                tmp_rssi = rssi;
            }
            if(m_enabled) show = true;
        }
        if(show) {
            xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_rssiSymbol_x, m_y, m_rssiSymbol_w, m_h);
        }
            drawImage(m_rssiSymbol[new_rssi], m_rssiSymbol_x, m_y);
            xSemaphoreGive(mutex_display);
        }
    }
    void updateTime(const char* hl_time, bool complete = true){
        if(!m_enabled) return;
        memcpy(m_time, hl_time, 8); // hhmmss
        static char oldtime[8] = {255}; // hhmmss
        uint8_t*    pos = NULL;
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_timeColor);
        if(complete == true) {
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_time_x, m_y, m_time_w, m_h);
            }
            else{
                tft.fillRect(m_time_x, m_y, m_time_w, m_h, m_bgColor);
            }
            for(uint8_t i = 0; i < 8; i++) { oldtime[i] = 255; }
        }
        for(uint8_t i = 0; i < 8; i++) {
            if(oldtime[i] != m_time[i]) {
                char ch[2] = {0, 0};
                ch[0] = m_time[i];
                pos = m_time_pos;
                if(m_backgroundTransparency){
                    tft.copyFramebuffer(1, 0, m_time_x + pos[i], m_y, m_time_ch_w, m_h);
                }
                else{
                    tft.fillRect(m_time_x + pos[i], m_y, m_time_ch_w, m_h, m_bgColor);
                }
                tft.writeText(ch, m_time_x + pos[i], m_y, m_time_ch_w, m_h, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true);
                oldtime[i] = m_time[i];
            }
        }
        xSemaphoreGive(mutex_display);
    }
    void setTimeColor(uint16_t timeColor){
        m_timeColor = timeColor;
        updateTime(m_time, true);
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
};
