schreibfaul1/ESP32-MiniWebRadio/src/common.h
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class displayFooter : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint8_t     m_fontSize = 0;
    int8_t      m_timeCounter = 0;
    uint8_t     m_volume = 0;
    uint16_t    m_staNr = 0;
    uint16_t    m_offTime = 0;
    uint32_t    m_bitRate = 0;
    uint16_t    m_bgColor = TFT_BLACK;
    uint16_t    m_stationColor = TFT_LAVENDER;
    uint16_t    m_bitRateColor = TFT_LAVENDER;
    uint16_t    m_ipAddrColor = TFT_GREENYELLOW;
    char*       m_name = NULL;
    char*       m_ipAddr = NULL;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_backgroundTransparency = false;
    releasedArg m_ra;
    const char  m_stationSymbol[22]     = "/common/Antenna.png";
    const char  m_hourGlassymbol[2][27] = {"/common/Hourglass_blue.png", "/common/Hourglass_red.png"};
#if TFT_CONTROLLER < 2 // 320 x 240px
    uint16_t    m_antennaSymbol_x = 0;
    uint16_t    m_staNr_x = 25, m_staNr_w = 32;
    uint16_t    m_flag_x = 57;
    uint16_t    m_flag_w = 40;
    uint16_t    m_flag_h = 0; // will be calculated
    uint16_t    m_offTimerSymbol_x = 100;
    uint16_t    m_offTimerSymbol_w = 20;
    uint16_t    m_offTimerNr_x = 122, m_offTimerNr_w = 35;
    uint16_t    m_bitRate_x = 158, m_bitRate_w = 42;
    uint16_t    m_ipAddr_x = 200, m_ipAddr_w = 120;
#else // 480 x 320px
    uint16_t    m_antennaSymbol_x = 0;
    uint16_t    m_staNr_x = 30, m_staNr_w = 50;
    uint16_t    m_flag_x = 80;
    uint16_t    m_flag_w = 48;
    uint16_t    m_flag_h = 0; // will be calculated
    uint16_t    m_offTimerSymbol_x = 132;
    uint16_t    m_offTimerSymbol_w = 24;
    uint16_t    m_offTimerNr_x = 160, m_offTimerNr_w = 54;
    uint16_t    m_bitRate_x = 214, m_bitRate_w = 66;
    uint16_t    m_ipAddr_x = 280, m_ipAddr_w = 200;
#endif
public:
    displayFooter(const char* name, uint8_t fontSize){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("displayFooter");
        m_bgColor = TFT_BLACK;
        m_fontSize = fontSize;
    }
    ~displayFooter(){
        x_ps_free(&m_name);
        x_ps_free(&m_ipAddr);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w;
        m_h = h;
        m_flag_h = m_h;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool transparency = false){
        m_backgroundTransparency = transparency;
        m_enabled = true;
        m_clicked = false;
        drawImage(m_stationSymbol, m_antennaSymbol_x, m_y);
        updateStation(m_staNr);
        updateOffTime(m_offTime);
        updateBitRate(m_bitRate);
        if(m_ipAddr) writeIpAddr(m_ipAddr);
        else         writeIpAddr("");
    }
    void hide(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    void disable(){
        m_enabled = false;
    }
    void setBGcolor(uint32_t color){
        m_bgColor = color;
    }
    void updateStation(uint16_t staNr){// radio, clock, audioplayer...
        m_staNr = staNr;
        if(!m_enabled) return;
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_staNr_x, m_y, m_staNr_w, m_h);
        }
        else{
            tft.fillRect(m_staNr_x, m_y, m_staNr_w, m_h, m_bgColor);
        }
        tft.setFont(m_fontSize);
        tft.setTextColor(m_stationColor);
        char buff[10];
        sprintf(buff, "%03d", staNr);
        tft.writeText(buff, m_staNr_x, m_y, m_staNr_w, m_h);
        xSemaphoreGive(mutex_display);
    }
    void setStationNrColor(uint16_t stationColor){
        m_stationColor = stationColor;
    }
    void updateFlag(const char* flag){
        if(!m_enabled) return;
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_flag_x, m_y, m_flag_w, m_h);
        }
        else{
            tft.fillRect(m_flag_x, m_y, m_flag_w, m_h, m_bgColor);
        }
        if(flag) tft.drawJpgFile(SD_MMC, flag, m_flag_x, m_y, m_flag_w, m_h);
        xSemaphoreGive(mutex_display);
    }
    void updateOffTime(uint16_t offTime){
        m_offTime = offTime;
        if(!m_enabled) return;
        char buff[15];
        sprintf(buff, "%d:%02d", m_offTime / 60, m_offTime % 60);
        tft.setFont(m_fontSize);
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(m_offTime){
            tft.setTextColor(TFT_RED);
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_offTimerSymbol_x, m_y, m_offTimerSymbol_w, m_h);
            }
            drawImage(m_hourGlassymbol[1], m_offTimerSymbol_x, m_y);
        }
        else{
            tft.setTextColor(TFT_DEEPSKYBLUE);
            drawImage(m_hourGlassymbol[0], m_offTimerSymbol_x, m_y);
        }
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_offTimerNr_x, m_y, m_offTimerNr_w, m_h);
        }
        else{
            tft.fillRect(m_offTimerNr_x, m_y, m_offTimerNr_w, m_h, m_bgColor);
        }
        tft.writeText(buff, m_offTimerNr_x, m_y, m_offTimerNr_w, m_h);
        xSemaphoreGive(mutex_display);
    }
    void updateTC(uint8_t timeCounter){
        m_timeCounter = timeCounter;
        if(!m_enabled) return;
        if(!m_timeCounter) {
            // if(m_backgroundTransparency){
            //     tft.copyFramebuffer(1, 0, m_bitRate_x, m_y, m_bitRate_w, m_h);
            // }
            // else {
            //     tft.fillRect(m_bitRate_x, m_y, m_bitRate_w, m_h, m_bgColor);
            // }
            updateBitRate(m_bitRate);
        }
        else{
            uint16_t x0   = m_bitRate_x;
            uint16_t x1x2 = round(m_bitRate_x + ((float)((m_bitRate_w) / 10) * timeCounter));
            uint16_t y0y1 = m_y + m_h - 5;
            uint16_t y2   = round((m_y  + m_h - 5) - ((float)(m_h - 6) / 10) * timeCounter);
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_bitRate_x, m_y, m_bitRate_w, m_h);
            }
            else{
                tft.fillRect(m_bitRate_x, m_y, m_bitRate_w, m_h, m_bgColor);
            }
            tft.fillTriangle(x0, y0y1, x1x2, y0y1, x1x2, y2, TFT_RED);
        }
    }

