schreibfaul1/ESP32-MiniWebRadio/src/common.h
    void updateBitRate(uint32_t bitRate){
        m_bitRate = bitRate;
        if(!m_enabled) return;
        char sbr[10];
        itoa(bitRate, sbr, 10);
        if(m_bitRate < 1000) { strcat(sbr, "K"); }
        else {
            sbr[2] = sbr[1];
            sbr[1] = '.';
            sbr[3] = 'M';
            sbr[4] = '\0';
        }
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_bitRate_x, m_y, m_bitRate_w, m_h);
        }
        else{
            tft.fillRect(m_bitRate_x, m_y, m_bitRate_w, m_h, m_bgColor);
        }
        tft.drawRect(m_bitRate_x, m_y, m_bitRate_w, m_h, m_bitRateColor);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_bitRateColor);
        tft.writeText(sbr, m_bitRate_x, m_y, m_bitRate_w, m_h, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
        xSemaphoreGive(mutex_display);
    }
    void setBitRateColor(uint16_t bitRateColor){
        m_bitRateColor = bitRateColor;
    }
    void setIpAddr(const char* ipAddr){
        if(!ipAddr)return;
        x_ps_free(&m_ipAddr);
        m_ipAddr = strdup(ipAddr);
    }
    void writeIpAddr(const char* ipAddr){
        char myIP[30] = "IP:";
        strcat(myIP, ipAddr);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_ipAddrColor);
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_ipAddr_x, m_y, m_ipAddr_w, m_h);
        }
        else{
            tft.fillRect(m_ipAddr_x, m_y, m_ipAddr_w, m_h, m_bgColor);
        }
        tft.writeText(myIP, m_ipAddr_x, m_y, m_ipAddr_w, m_h, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER, true, true, true);
        xSemaphoreGive(mutex_display);
    }
    void setIpAddrColor(uint16_t ipAddrColor){
        m_ipAddrColor = ipAddrColor;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        uint8_t pos = 0;
    //    if(x >= m_rssiSymbol_x && x <= m_rssiSymbol_x + m_rssiSymbol_w) pos = 3; // RSSI or TC
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, pos);
        if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
private:
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline void GetRunTimeStats( char *pcWriteBuffer ){
    // TaskStatus_t *pxTaskStatusArray;
    // volatile UBaseType_t uxArraySize, x;
    // uint32_t ulTotalRunTime, ulStatsAsPercentage;
    // char leftSpace[] = "             ";

    // // Make sure the write buffer does not contain a string.
    // *pcWriteBuffer = 0x00;

    // // Take a snapshot of the number of tasks in case it changes while this function is executing.
    // uxArraySize = uxTaskGetNumberOfTasks();

    // // Allocate a TaskStatus_t structure for each task.  An array could be allocated statically at compile time.
    // pxTaskStatusArray = (TaskStatus_t*)pvPortMalloc( uxArraySize * sizeof( TaskStatus_t ) );

    // if( pxTaskStatusArray != NULL ) {
    // // Generate raw status information about each task.
    //     uxArraySize = uxTaskGetSystemState( pxTaskStatusArray, (UBaseType_t)uxArraySize, &ulTotalRunTime );

    //     // For percentage calculations.
    //     ulTotalRunTime /= 100UL;

    //     char* tmpBuff = (char*) malloc(100);
    //     strcpy(pcWriteBuffer, leftSpace);
    //     strcat(pcWriteBuffer, ANSI_ESC_YELLOW "TASKNAME            | RUNTIMECOUNTER | TOTALRUNTIME[%] | CORE | PRIO  |\n");
    //     strcat(pcWriteBuffer, leftSpace);
    //     strcat(pcWriteBuffer,                 "--------------------+----------------+-----------------+------+-------|\n");

    //     // Avoid divide by zero errors.
    //     if(ulTotalRunTime > 0){
    //         // For each populated position in the pxTaskStatusArray array, format the raw data as human readable ASCII data
    //         for( x = 0; x < uxArraySize; x++ ) {
    //             // What percentage of the total run time has the task used? This will always be rounded down to the nearest integer.
    //             // ulTotalRunTimeDiv100 has already been divided by 100.
    //             ulStatsAsPercentage = pxTaskStatusArray[ x ].ulRunTimeCounter / ulTotalRunTime;
    //             memset(tmpBuff, 0x20, 100);
    //             memcpy(tmpBuff, pxTaskStatusArray[x].pcTaskName, strlen(pxTaskStatusArray[x].pcTaskName));
    //             tmpBuff[20] = '|';
    //             uint8_t core = (pxTaskStatusArray[x].xCoreID);
    //             uint8_t prio = (pxTaskStatusArray[x].uxBasePriority);
    //             if(ulStatsAsPercentage){
    //                 sprintf(tmpBuff + 23, "%12lu  |       %02lu%%       |%4d  |%5d  |", (long unsigned int)pxTaskStatusArray[ x ].ulRunTimeCounter, (long unsigned int)ulStatsAsPercentage, core, prio);
    //             }
    //             else{
    //                 sprintf(tmpBuff + 23, "%12lu  |       <1%%       |%4d  |%5d  |", (long unsigned int)pxTaskStatusArray[ x ].ulRunTimeCounter, core, prio);
    //             }
    //             uint8_t i = 23; while(tmpBuff[i] == '0') {tmpBuff[i] = ' '; i++;}
    //             if(tmpBuff[45] == '0') tmpBuff[45] = ' ';
    //             strcat(pcWriteBuffer, leftSpace);
    //             strcat(pcWriteBuffer, tmpBuff);
    //             strcat(pcWriteBuffer, "\n");
    //         }
    //         free(tmpBuff);
    //        }
    //     // The array is no longer needed, free the memory it consumes.
    //     vPortFree( pxTaskStatusArray );
    // }
}

const char ir_buttons_json[] =
    "[{\"A\":\"0x00\",\"label\":\"IR address\"},"
    "{\"C\":\"0x4a\",\"label\":\"IR command\"},"
    "{\"0\":\"0x52\",\"label\":\"ZERO\"},"
    "{\"10\":\"0x42\",\"label\":\"MUTE\"},"
    "{\"20\":\"0x40\",\"label\":\"SLEEP\"},"
    "{\"1\":\"0x16\",\"label\":\"ONE\"},"
    "{\"11\":\"0x43\",\"label\":\"ARROW RIGHT\"},"
    "{\"21\":\"0x4a\",\"label\":\"CANCEL\"},"
    "{\"2\":\"0x19\",\"label\":\"TWO\"},"
    "{\"12\":\"0x44\",\"label\":\"ARROW LEFT\"},"
    "{\"22\":\"-1\",\"label\":\"-\"},"
    "{\"3\":\"0x0d\",\"label\":\"THREE\"},"
    "{\"13\":\"0x15\",\"label\":\"ARROW DOWN\"},"
    "{\"4\":\"0x0c\",\"label\":\"FOUR\"},"
    "{\"14\":\"0x46\",\"label\":\"ARROW UP\"},"
    "{\"5\":\"0x18\",\"label\":\"FIVE\"},"
    "{\"15\":\"0x4a\",\"label\":\"MODE\"},"
    "{\"6\":\"0x5e\",\"label\":\"SIX\"},"
    "{\"16\":\"0x40\",\"label\":\"OK\"},"
    "{\"7\":\"0x08\",\"label\":\"SEVEN\"},"
    "{\"17\":\"0x20\",\"label\":\"-\"},"
    "{\"8\":\"0x1c\",\"label\":\"EIGHT\"},"
    "{\"18\":\"-1\",\"label\":\"-\"},"
    "{\"9\":\"0x5a\",\"label\":\"NINE\"},"
    "{\"19\":\"-1\",\"label\":\"-\"}]";

